DulanyaW/COMPSYS301/Uma/Hardware_task Mon Sep/hwTask2.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Clock_PWM.h"
#include "M1_IN1_aliases.h"
#include "M1_IN1.h"
#include "M1_IN2_aliases.h"
#include "M1_IN2.h"
#include "QuadDec_M1.h"
#include "QuadDec_M1_PVT.h"
#include "M1_QA_aliases.h"
#include "M1_QA.h"
#include "M1_QB_aliases.h"
#include "M1_QB.h"
#include "M1_D1_aliases.h"
#include "M1_D1.h"
#include "M2_D1_aliases.h"
#include "M2_D1.h"
#include "CONTROL.h"
#include "PWM_1.h"
#include "Clock_QENC.h"
#include "M1_IN1_1_aliases.h"
#include "M1_IN1_1.h"
#include "M1_IN2_1_aliases.h"
#include "M1_IN2_1.h"
#include "PWM_2.h"
#include "USBUART_1.h"
#include "USBUART_1_audio.h"
#include "USBUART_1_cdc.h"
#include "USBUART_1_hid.h"
#include "USBUART_1_midi.h"
#include "USBUART_1_pvt.h"
#include "USBUART_1_cydmac.h"
#include "USBUART_1_msc.h"
#include "Timer_1.h"
#include "QuadDec_M2.h"
#include "QuadDec_M2_PVT.h"
#include "M2_QA_aliases.h"
#include "M2_QA.h"
#include "M2_QB_aliases.h"
#include "M2_QB.h"
#include "isr_1.h"
#include "UART.h"
#include "RF_BT_SELECT.h"
#include "isr_2.h"
#include "isr_3.h"
#include "isr_4.h"
#include "isr_5.h"
#include "QuadDec_M1_isr.h"
#include "QuadDec_M1_Cnt16.h"
#include "USBUART_1_Dm_aliases.h"
#include "USBUART_1_Dm.h"
#include "USBUART_1_Dp_aliases.h"
#include "USBUART_1_Dp.h"
#include "QuadDec_M2_isr.h"
#include "QuadDec_M2_Cnt16.h"
#include "UART_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

